In [1]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

# Data Loading

In [2]:
df=pd.read_csv("cleaned_messy_HR_data.csv")
print(df)

       Name  Age        Salary  Gender Department   Position Joining Date  \
0     grace   25  50000.000000    Male         HR    Manager   2018-04-05
1     david    0  65000.000000  Female    Finance   Director          NaN
2    hannah   35  60000.000000  Female      Sales   Director          NaN
3       eve    0  50000.000000  Female         IT    Manager   2018-04-05
4     grace    0  60216.086435  Female    Finance    Manager          NaN
..      ...  ...           ...     ...        ...        ...          ...
995    jack   50  65000.000000  Female         HR    Manager          NaN
996    jack   30  50000.000000    Male    Finance    Analyst   2018-04-05
997  hannah   30  70000.000000    Male         IT  Assistant          NaN
998     bob   25  65000.000000   Other  Marketing    Manager   2018-04-05
999     ivy   30  60000.000000    Male    Finance    Manager          NaN

    Performance Score                 Email  Phone Number
0                   D     email@example.com  000-000-0000
1                   F       user@domain.com  123-456-7890
2                   C     email@example.com  098-765-4321
3                   A      name@company.org           NaN
4                   F      name@company.org  098-765-4321
..                ...                   ...           ...
995                 F  no_email@example.com  098-765-4321
996                 C  no_email@example.com  555-555-5555
997                 D       user@domain.com  000-000-0000
998                 D     email@example.com  000-000-0000
999                 C       user@domain.com  123-456-7890

[1000 rows x 10 columns]

# Data Exploration

In [3]:
print(f"Number of Rows:{df.shape[0]}\n Number of coloum:{df.shape[1]}")

Number of Rows:1000
 Number of coloum:10

In [4]:
df.head(10)

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
0,grace,25,50000.000000,Male,HR,Manager,2018-04-05,D,email@example.com,000-000-0000
1,david,0,65000.000000,Female,Finance,Director,NaN,F,user@domain.com,123-456-7890
2,hannah,35,60000.000000,Female,Sales,Director,NaN,C,email@example.com,098-765-4321
3,eve,0,50000.000000,Female,IT,Manager,2018-04-05,A,name@company.org,NaN
4,grace,0,60216.086435,Female,Finance,Manager,NaN,F,name@company.org,098-765-4321
5,jack,0,65000.000000,Other,Marketing,Director,NaN,F,user@domain.com,000-000-0000
6,charlie,0,50000.000000,Male,Marketing,Clerk,NaN,B,no_email@example.com,123-456-7890
7,grace,40,50000.000000,Other,HR,Director,NaN,C,no_email@example.com,NaN
8,hannah,40,60000.000000,Female,Marketing,Manager,NaN,C,user@domain.com,123-456-7890
9,eve,30,60216.086435,Other,Finance,Assistant,NaN,A,no_email@example.com,NaN

In [5]:
df.tail(2)

,Name,Age,Salary,Gender,Department,Position,Joining Date,Performance Score,Email,Phone Number
998,bob,25,65000.0,Other,Marketing,Manager,2018-04-05,D,email@example.com,000-000-0000
999,ivy,30,60000.0,Male,Finance,Manager,NaN,C,user@domain.com,123-456-7890

In [6]:
df.describe()

               Age        Salary
count  1000.000000   1000.000000
mean     30.110000  60216.086435
std      15.266662   6504.106999
min       0.000000  50000.000000
25%      25.000000  55000.000000
50%      30.000000  60216.086435
75%      40.000000  65000.000000
max      50.000000  70000.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               1000 non-null   object
 1   Age                1000 non-null   int64
 2   Salary             1000 non-null   float64
 3   Gender             1000 non-null   object
 4   Department         1000 non-null   object
 5   Position           1000 non-null   object
 6   Joining Date       186 non-null    object
 7   Performance Score  1000 non-null   object
 8   Email              1000 non-null   object
 9   Phone Number       809 non-null    object
dtypes: float64(1), int64(1), object(8)
memory usage: 78.3+ KB

In [8]:
df.columns

Index(['Name', 'Age', 'Salary', 'Gender', 'Department', 'Position',
       'Joining Date', 'Performance Score', 'Email', 'Phone Number'],
      dtype='object')

In [9]:
df.count()

Name                 1000
Age                  1000
Salary               1000
Gender               1000
Department           1000
Position             1000
Joining Date          186
Performance Score    1000
Email                1000
Phone Number          809
dtype: int64

In [10]:
df['Department'].unique()

array(['HR', 'Finance', 'Sales', 'IT', 'Marketing'], dtype=object)

In [11]:
df.nunique()

Name                 10
Age                   6
Salary                6
Gender                3
Department            5
Position              5
Joining Date          1
Performance Score     5
Email                 4
Phone Number          4
dtype: int64

In [12]:
df.isnull().sum()

Name                   0
Age                    0
Salary                 0
Gender                 0
Department             0
Position               0
Joining Date         814
Performance Score      0
Email                  0
Phone Number         191
dtype: int64